# Общая информатика

## Лабораторная работа №__

### Содержание

1. ...
2. ...
3. ...

### 1. Задание

Написать программу, выводящую в табличку значение X и соответствующее значение F(x) с задаваемыми начальным, конечным значениями аргумента и шагом.

### 2. Блок-схема (не обзятельно) и/или описание алгоритма



### 3. Текст программы

```c++
#include <iostream>
#include <cmath>
#include <iomanip>

/*lr1 Sizov gr.2105*/
using namespace std;

int main()
{
    char flag = 'Y';
    
    while (flag == 'Y') 
    {
        float x1, xn; int n;
        cout << "enter start argument: ";
        cin >> x1;
        cout << "enter last argument: ";
        cin >> xn;
        cout << "enter number of calculable lines: ";
        cin >> n;
      
        cout << "----------------------\n"
             << "|    x    |  sin(x)  |\n"
             << "----------------------\n";
      
        float d;
        d = (xn - x1)/(n--);
        for (float x = x1;  x <= xn; x += d){
            cout << '|' << setw (9) << setprecision(3) << x
                 << '|' << setw (10) << fixed << sin(x) << "|\n";
        }
       
        cout << "----------------------\n";
        cout << "enter 'Y' to repeat: ";
        cin >> flag;
    }
    return 0;
}
```

### 4. Описание работы программы

Зависимость F(x) задается внутри программы, общение с пользователем реализовано посредством консоли.
